// UNIT PRESET FROM Jacob Banner
// https://codepen.io/jacobbanner/pen/oxeoqp

var property = new Array()
var unit = new Array()
var factor = new Array()
var permax = new Array()

property[1] = "넓이";
unit[1] = new Array("제곱킬로미터 (km^2)", "제곱미터 (m^2)", "제곱센티미터 (cm^2)", "제곱피트 (ft^2)", "제곱인치 (in^2)", "제곱마일 (mi^2)", "제곱야드 (yd^2)", "평", "에이커 (acre)", "아르 (a)", "반 (barn)", "헥타르 (ha)", "루드 (rood)", "서큘러 밀");
factor[1] = new Array(1E+6, 1, .1E-4, 9.290304E-02, 6.4516E-04, 2589988, .8361274, 3.305785, 4046.856, 100, 1E-28, 10000, 1011.71413184285, 5.067075E-10);
permax[1] = 1E-4

property[7] = "길이";
unit[7] = new Array("킬로미터 (km)", "미터 (m)", "센티미터 (cm)", "밀리미터 (mm)", "마이크로미터 (mu-m)", "나노미터 (nm)", "피코미터 (pm)", "펨토미터 (fm)", "옹스트롬 (Å)", "천문단위 (AU)", "패덤", "펄롱", "피트 (ft)", "인치 (in)", "광년 (LY)", "마일 (mi)", "파섹 (pc)", "파이카", "포인트 (pt)", "야드 (yd)", "자 (尺)", "간 (間)", "정 (町)", "리 (里)", "해리 (海里)");
factor[7] = new Array(1000, 1, .01, .001, 1E-6, 1E-9, 1E-12, 1E-15, 1E-10, 1.49598E11, 1.8288, 201.168, .3048, .0254, 9.46055E+15, 1609.344, 3.08374E+16, 4.217518E-03, .0003514598, .9144, .30303, 1.818182, 109.090909, 392.727273, 1852);
permax[7] = 1E-1

property[9] = "질량"
unit[9] = new Array("킬로그램 (kg)", "그램 (g)", "밀리그램 (mg)", "마이크로그램 (mu-g)", "캐럿 (ct)", "파운드 (lb)", "온스 (oz)", "톤 (t)", "돈", "냥", "근", "관")
factor[9] = new Array(1, .001, 1E-6, 1E-9, .0002, .4535924, .02834952, 1000, .00375, .0375, .6, 3.75)
permax[9] = 1E+2

property[15] = "시간"
unit[15] = new Array("밀리초", "초", "분", "시간", "일", "주", "개월", "년", "연대", "세기")
factor[15] = new Array(0.001, 1, 60, 3600, 8.640E4, 604800, 2628000, 31536000, 315360000, 3153600000)
permax[15] = 864E+5

property[16] = "속도";
unit[16] = new Array("초당미터 (m/s)", "시간당킬로미터 (km/h)", "분당피트 (ft/min)", "초당피트 (ft/s)", "노트 (kn)", "시간당마일 (mi/h)", "분당마일 (mi/min)", "초당마일 (mi/s)", "광속 (c)", "마하 (a)");
factor[16] = new Array(1, .2777778, 5.08E-03, .3048, .5144444, .44707, 26.8224, 1609.344, 299792458, 340.0068750);
permax[16] = 83

property[18] = "부피";
unit[18] = new Array("세제곱미터 (m^3)", "세제곱센티미터 (cm^3)", "세제곱밀리미터 (mm^3)", "리터 (l)", "밀리리터 (ml, cc)", "세제곱피트 (ft^3)", "세제곱인치 (in^3)", "세제곱야드 (yd^3)", "에이커 풋", "배럴 (bbl)", "보드푸트", "부셸 (US)", "컵 (US)", "액량 갤런 (UK)", "액량 갤런 (US)", "질 (UK)", "질 (US)", "플루이드 온스 (UK)", "플루이드 온스 (US)", "액량 파인트 (US)", "액량 쿼트 (US)", "테이블스푼 (US)", "티스푼 (US)", "홉", "되", "말");
factor[18] = new Array(1, 1E-6, 1E-9, 0.001, 1E-6, .02831685, .00001638706, .7645549, 1233.482, .1589873, .002359737, .03523907, .0002365882, .004546087, .003785412, .0001420652, .0001182941, .00002841305, .00002957353, 4.7317650E-04, 9.46353E-04, .00001478676, .000004928922, 1804E-7, 1804E-6, 1804E-5);
permax[18] = 1E-2
